app/controllers/sale_controller.rb

SELECT `sales`.* FROM `sales` ORDER BY created_at DESC
---
    def index
        sales = Sale.order('created_at DESC');

SELECT `sales`.* FROM `sales` WHERE `sales`.`id` = 1 LIMIT 1
---
    def show
        sale = Sale.find(params[:id])

INSERT INTO `sales` (`client_id`, `seller_id`, `created_at`, `updated_at`) VALUES (1, 1, '2021-11-01 20:45:21.387162', '2021-11-01 20:45:21.387162')
---
    def create
        sale = nil
        ret = false
        newArrPrd = []
        begin
            Sale.transaction do
                sale = Sale.new(sale_params)
                if sale.save

SELECT `productsales`.* FROM `productsales` WHERE `productsales`.`sale_id` = 45
INSERT INTO `productsales` (`sale_id`, `product_id`, `value`, `quantity`, `created_at`, `updated_at`) VALUES (46, 1, 10.0, 2, '2021-11-02 13:36:48.108925', '2021-11-02 13:36:48.108925')
---
    def addProductSales(sale_id)
        arrProducts = params[:productsales]
        arrProducts.each do |product|
            newproduct = Hash.new
            newproduct[:sale_id] = "#{sale_id}"
            newproduct[:product_id] = product[:product_id]
            newproduct[:value] = product[:value]
            newproduct[:quantity] = product[:quantity]
            retprd = Productsale.new(newproduct)
            retprd.save

DELETE FROM `productsales` WHERE `productsales`.`sale_id` = 46
---
    def delProductSales(sale_id)
        Productsale.where(:sale_id => sale_id).delete_all

SELECT `sales`.* FROM `sales` WHERE `sales`.`id` = 46 LIMIT 1
UPDATE `sales` SET `sales`.`client_id` = 2, `sales`.`seller_id` = 2, `sales`.`updated_at` = '2021-11-02 13:54:55.525513' WHERE `sales`.`id` = 46
---
    def update
        ret = false
        sale = nil
        begin
            Sale.transaction do
                sale_id = params[:id]
                sale = Sale.find(sale_id)
                newsale = Hash.new
                newsale[:id] = sale_id
                newsale[:client_id] = params[:client_id]
                newsale[:seller_id] = params[:seller_id]
                newsale[:created_at] = sale[:created_at]
                newsale[:updated_at] = sale[:updated_at]
                if sale.update(newsale)

SELECT `sales`.* FROM `sales` WHERE `sales`.`id` = 46 LIMIT 1
DELETE FROM `sales` WHERE `sales`.`id` = 46
---
    def destroy
        sale_id = params[:id]
        delProductSales(sale_id)
        sale = Sale.find(params[:id])
        if sale.destroy