app/controllers/seller_controller.rb

    def index
        sellers = Seller.order('created_at DESC');
---
SELECT `sellers`.* FROM `sellers` ORDER BY created_at DESC

    def show
        seller = Seller.find(params[:id])
---
SELECT `sellers`.* FROM `sellers` WHERE `sellers`.`id` = 1 LIMIT 1

    def create
        seller = Seller.new(seller_params)

        if seller.save
---
INSERT INTO `sellers` (`number`, `name`, `email`, `phone`, `address`, `created_at`, `updated_at`) VALUES ('1', 'Rodrigo Castro', 'rodrigo@gmail.com', '31-99368-1841', 'Rua das Industrias, 1177, apto 203', '2021-11-01 18:28:28.491712', '2021-11-01 18:28:28.491712')

    def destroy
        seller = Seller.find(params[:id])
        if seller.destroy
---
SELECT `sellers`.* FROM `sellers` WHERE `sellers`.`id` = 3 LIMIT 1
DELETE FROM `sellers` WHERE `sellers`.`id` = 3

    def update
        seller = Seller.find(params[:id])
        if seller.update(seller_params)
---
SELECT `sellers`.* FROM `sellers` WHERE `sellers`.`id` = 3 LIMIT 1
UPDATE `sellers` SET `sellers`.`number` = '007', `sellers`.`name` = 'lane', `sellers`.`email` = 'csc', `sellers`.`phone` = '31', `sellers`.`address` = 'rua ', `sellers`.`updated_at` = '2021-11-01 18:29:03.084074' WHERE `sellers`.`id` = 3